{
    "intents": [
      {
        "tag": "greeting",
        "patterns": [
          "Hi",
          "Hello",
          "Hey",
          "Good morning",
          "Good evening",
          "What's up?",
          "Howdy"
        ],
        "responses": [
          "Hello! Welcome to MarAcademy. How can I assist you today?",
          "Hi there! What do you need help with at MarAcademy?",
          "Hey! How can I help you with your learning journey?"
        ]
      },
      {
        "tag": "goodbye",
        "patterns": [
          "Bye",
          "Goodbye",
          "See you later",
          "Take care",
          "I'm leaving now"
        ],
        "responses": [
          "Goodbye! Hope to see you back at MarAcademy soon.",
          "Take care! Let us know if you need any help.",
          "See you later! Keep learning."
        ]
      },
      {
        "tag": "courses_offered",
        "patterns": [
          "What courses do you offer?",
          "Tell me about your courses",
          "What can I learn here?",
          "List the available courses",
          "Do you have any programming courses?"
        ],
        "responses": [
          "We offer a variety of courses including beginner programming, data science, machine learning, and career development. Which one are you interested in?",
          "Our courses include free coding lessons, career preparation, and scholarship opportunities. Let me know what you're looking for!"
        ]
      },
      {
        "tag": "course_details",
        "patterns": [
          "Can you tell me more about the programming course?",
          "What does the data science course include?",
          "What will I learn in the machine learning course?",
          "Are there any scholarships for high school students?"
        ],
        "responses": [
          "Our beginner programming course covers the basics of coding, including variables, loops, and functions. Would you like to enroll?",
          "The data science course introduces data analysis, visualization, and machine learning basics. Can I help you register?",
          "Our scholarships are aimed at high school students to help them access our free coding courses. Would you like to know more?"
        ]
      },
      {
        "tag": "registration_help",
        "patterns": [
          "How do I register?",
          "What is the registration process?",
          "Can you help me sign up?",
          "I want to create an account",
          "How do I enroll in a course?"
        ],
        "responses": [
          "To register, visit our website, create an account, and select the course you'd like to enroll in. Need further assistance?",
          "You can sign up by clicking the 'Register' button on our homepage and following the steps. Do you need a walkthrough?"
        ]
      },
      {
        "tag": "technical_support",
        "patterns": [
          "I'm having trouble logging in",
          "The website is not working",
          "I can't access my course",
          "Something is wrong with my account",
          "Can you help with a technical issue?"
        ],
        "responses": [
          "I'm sorry you're having trouble. Please describe the issue, and we'll resolve it as soon as possible.",
          "Technical issues can be frustrating. Can you provide more details so I can assist you better?"
        ]
      },
      {
        "tag": "instructor_permissions",
        "patterns": [
          "Can instructors access admin sections?",
          "What permissions do instructors have?",
          "How do I manage instructor permissions?",
          "Can instructors edit course content?"
        ],
        "responses": [
          "Instructors have access to specific admin sections related to course management. Would you like detailed instructions on managing permissions?",
          "Yes, instructors can access admin sections to update their courses. Do you need help setting this up?"
        ]
      },
      {
        "tag": "maracademy_mission",
        "patterns": [
          "What is MarAcademy about?",
          "Tell me about MarAcademy",
          "What is your mission?",
          "Why was MarAcademy created?"
        ],
        "responses": [
          "MarAcademy aims to provide free coding courses, career development, and scholarship opportunities for high school students. We are dedicated to making education accessible to everyone.",
          "Our mission is to empower students with coding skills, professional guidance, and opportunities to advance their careers."
        ]
      },
      {
        "tag": "about_founder",
        "patterns": [
          "Who is the founder of MarAcademy?",
          "Tell me about the founder",
          "Who created MarAcademy?",
          "What can you tell me about Omar Keita?"
        ],
        "responses": [
          "MarAcademy was founded by Omar Keita, a passionate machine learning engineer dedicated to making education accessible to everyone. He believes in empowering students with the skills they need to succeed.",
          "Omar Keita, the founder of MarAcademy, is committed to providing free learning resources and career opportunities for high school students worldwide."
        ]
      },
      {
        "tag": "contact_support",
        "patterns": [
          "How do I contact support?",
          "Is there a way to get help?",
          "Who can I reach out to for assistance?",
          "Can I email support?",
          "How can I get in touch with someone?"
        ],
        "responses": [
          "You can reach out to our support team through the 'Contact Us' page on our website. Is there anything specific you need help with right now?",
          "Feel free to email us at support@maracademy.com or use the chat function on our website for assistance."
        ]
      },
      {
        "tag": "feedback",
        "patterns": [
          "I want to give feedback",
          "How can I provide suggestions?",
          "Where can I submit a review?",
          "Can I share my thoughts on the course?"
        ],
        "responses": [
          "We'd love to hear your feedback! You can submit it through our website or email us at feedback@maracademy.com.",
          "Your suggestions are valuable to us. Please fill out the feedback form on our website or drop us an email."
        ]
      },
      {
        "tag": "schedule_update",
        "patterns": [
          "When will the website be updated?",
          "Are you adding new courses soon?",
          "What is the update schedule for MarAcademy?",
          "When will new features be added?"
        ],
        "responses": [
          "We regularly update the website to add new courses and features. Our next major update is scheduled for Thursday after 11:00 AM. Stay tuned!",
          "New content and features are added frequently. If you're waiting for something specific, let us know!"
        ]
      },
      {
        "tag": "career_opportunities",
        "patterns": [
          "Do you offer career development programs?",
          "How can MarAcademy help with my career?",
          "Are there resources for job preparation?",
          "Do you provide resume building or interview tips?"
        ],
        "responses": [
          "Yes, we offer career development programs including resume building, interview preparation, and guidance on job applications. Would you like to know more?",
          "Our career resources are designed to help you succeed. Let me know if you'd like details about resume tips or interview strategies."
        ]
      },
      {
        "tag": "faq",
        "patterns": [
          "Where can I find the FAQ?",
          "Do you have a help section?",
          "Is there a list of frequently asked questions?",
          "Can I read more about how MarAcademy works?"
        ],
        "responses": [
          "You can find our FAQ section on the website under the 'Help' menu. Let me know if you have any specific questions!",
          "Our FAQ section has answers to common queries. Would you like me to point you to a specific topic?"
        ]
      }
    ]
  }
  